<?php
/** Группировка билетов
 * Дан массив заказов, содержащий id(номер заказа) и массив билетов в этом заказе.
 * Вас попросили вывести отчёт по заказам, в котором билеты будут сгруппированы по цене.
 * Если водном заказе есть билеты по разным ценам - каждая такая строка должна быть выведена отдельно, а номер заказа продублирован.
 *
 * Пример:
 * $orders = [
*        ['id' => 1, 'tickets' => [
*       ['id' => 1, 'price' => 100],
*        ['id' => 2, 'price' => 100],
*        ['id' => 3, 'price' => 200],
*        ['id' => 4, 'price' => 300]
*        ]],
*        ['id' => 2, 'tickets' => [
*        ['id' => 5, 'price' => 100],
*        ['id' => 6, 'price' => 100]
*        ]]
*        ];
*
 * Вывод:
 * $result = [
 * ['orderId' => 1, 'count' => 2, 'sum' => 200],
 * ['orderId' => 1, 'count' => 1, 'sum' => 200],
 * ['orderId' => 1, 'count' => 1, 'sum' => 300],
 * ['orderId' => 2, 'count' => 2, 'sum' => 200],
 * ];
 *
 * В первом заказе есть билеты по 100, они должны быть просуммированы, так же в первом заказе есть билеты по 200 и 300, которые выведены отдельно.
 * В закахзе №2 все билеты стоят одинаково, поэтому они просуммированы и выведены одной строчкой.
 *
 *
 * Описание алгоритма:
    1. Создаём временный массив для хранения результатов
    2. В цикле перебираем все билеты и суммируем результаты в элементы временного массива
        с ключами "номер заказа_цена"
    3. Возвращаем результат
 *
 * ЗАТРАЧЕНО: 15 минут.
 */

$orders = [
    ['id' => 1, 'tickets' => [
        ['id' => 1, 'price' => 100],
        ['id' => 2, 'price' => 100],
        ['id' => 3, 'price' => 200],
        ['id' => 4, 'price' => 300]
    ]],
    ['id' => 2, 'tickets' => [
        ['id' => 5, 'price' => 100],
        ['id' => 6, 'price' => 100]
    ]]
];

function createReport(array $orders):array 
{
    $lines = array();
    $temp_arr = array();

    foreach ($orders as $order) {
        foreach ($order['tickets'] as $ticket) {
            $temp_arr[$order['id'].'_'.$ticket['price']]['orderId'] = $order['id'];
            $temp_arr[$order['id'].'_'.$ticket['price']]['count'] += 1;
            $temp_arr[$order['id'].'_'.$ticket['price']]['sum'] += $ticket['price'];
        }
    }

    $lines = array_values($temp_arr);
    return $lines;
}

echo "<pre>";
print_r(createReport($orders));
echo "</pre>";